---
kind: other
id: Methods.T:Autodesk.Revit.DB.Binding
source: html/50046a95-2aef-b896-8ada-f29e9a0b50fc.htm
---
# Binding Methods

Causes the object to release immediately any resources it may be utilizing.